Revit 2027 API
IFCExtrusionBasis Enumeration
 This enumerated type represents the possible bases for derivation of extrusion geometry.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum IFCExtrusionBasis
Public Enumeration IFCExtrusionBasis
public enum class IFCExtrusionBasis
type IFCExtrusionBasis
Members
Member name | Value | Description
BasisX | 0 |  The X direction.
BasisY | 1 |  The Y direction.
BasisZ | 2 |  The Z direction.
InvalidBasis | -1 |  An invalid basis (typically indicating that the extrusion extraction was unsuccessful).
See Also
Reference
Autodesk.Revit.DB.IFC Namespace